app/controllers/tasks_controller.rb

    def create
        @task = Task.new(task_params)
        @task.save
---
INSERT INTO "tasks" ("title", "details", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Be better on Ruby"], ["details", "Learn learn"], ["created_at", "2019-04-08 14:58:42.179225"], ["updated_at", "2019-04-08 14:58:42.179225"]]

    def update
        @task = Task.find(params[:id])
        @task.update(task_params)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "details" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["details", "Learn learn and learn again"], ["updated_at", "2019-04-08 15:10:49.596244"], ["id", 1]]

    def show
        @task = Task.find(params['id'])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]